Revit 2027 API
BuiltInFailures.ConnectorFailures.LayoutConnector Property
 [Unassigned System Type] on Connector [Index Number].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LayoutConnector { get; }
Public Shared ReadOnly Property LayoutConnector As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LayoutConnector {
	FailureDefinitionId^ get ();
}
static member LayoutConnector : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ConnectorFailures Class
Autodesk.Revit.DB Namespace